import random

import matplotlib.pyplot as plt
import numpy as np

# 折线图
# x = range(0, 40)
# y = [random.randint(20, 35) for i in range(40)]
# y1 = [random.randint(20, 35) for i in range(40)]
#
# # 设置图片大小
# plt.figure(figsize=(20, 8), dpi=80)
# # 设置可显示中文
# plt.rcParams['font.sans-serif'] = ['SimHei']
# plt.rcParams['axes.unicode_minus'] = False
# # 设置x的刻度
# plt.xticks(x, ["{}时".format(i) for i in x], color='red', rotation=60)
# # 设置y的刻度
# plt.yticks(y)
# # 添加描述信息
# plt.xlabel("时间")
# plt.ylabel("温度")
# plt.title("10点到12点每分钟的变化情况")
# # 绘制网格
# plt.grid()
# # 绘制图片
# plt.plot(x, y, label='北京', color='red')
# plt.plot(x, y1, label='上海', color='blue')
# # 添加图例
# plt.legend()
# # 展示图片
# plt.show()


# 条形图
# a = ["战狼2", "速度与激情8", "功夫瑜伽", "西游伏妖篇", "变形金刚5：最后的骑士", "摔跤吧！爸爸", "加勒比海盗5：死无对证", "金刚：骷髅岛", "极限特工：终极回归", "生化危机6：终章",
#      "乘风破浪", "神偷奶爸3", "智取威虎山", "大闹天竺", "金刚狼3：殊死一战", "蜘蛛侠：英雄归来", "悟空传", "银河护卫队2", "情圣", "新木乃伊", ]
# b = [56.01, 26.94, 17.53, 16.49, 15.45, 12.96, 11.8, 11.61, 11.28, 11.12, 10.49, 10.3, 8.75, 7.55, 7.32, 6.99, 6.88,
#      6.86, 6.58, 6.23]
# # 设置图片大小
# plt.figure(figsize=(20, 8), dpi=80)
# # 设置可显示中文
# plt.rcParams['font.sans-serif'] = ['SimHei']  # 显示中文标签
# plt.rcParams['axes.unicode_minus'] = False
# # 调整刻度
# plt.xticks(range(len(a)), ["{}".format(i) for i in a], rotation=60)
# plt.yticks(range(0, 60, 10))
# # 添加描述信息
# plt.xlabel("电影")
# plt.ylabel("票房(亿元)")
# plt.title("2017电影票房")
# # 绘制图片
# plt.bar(a, b, width=0.3)
# plt.show()


# 直方图
# a = [131, 98, 125, 131, 124, 139, 131, 117, 128, 108, 135, 138, 131, 102, 107, 114, 119, 128, 121, 142, 127, 130, 124,
#      101, 110, 116, 117, 110, 128, 128, 115, 99, 136, 126, 134, 95, 138, 117, 111, 78, 132, 124, 113, 150, 110, 117, 86,
#      95, 144, 105, 126, 130, 126, 130, 126, 116, 123, 106, 112, 138, 123, 86, 101, 99, 136, 123, 117, 119, 105, 137,
#      123, 128, 125, 104, 109, 134, 125, 127, 105, 120, 107, 129, 116, 108, 132, 103, 136, 118, 102, 120, 114, 105, 115,
#      132, 145, 119, 121, 112, 139, 125, 138, 109, 132, 134, 156, 106, 117, 127, 144, 139, 139, 119, 140, 83, 110, 102,
#      123, 107, 143, 115, 136, 118, 139, 123, 112, 118, 125, 109, 119, 133, 112, 114, 122, 109, 106, 123, 116, 131, 127,
#      115, 118, 112, 135, 115, 146, 137, 116, 103, 144, 83, 123, 111, 110, 111, 100, 154, 136, 100, 118, 119, 133, 134,
#      106, 129, 126, 110, 111, 109, 141, 120, 117, 106, 149, 122, 122, 110, 118, 127, 121, 114, 125, 126, 114, 140, 103,
#      130, 141, 117, 106, 114, 121, 114, 133, 137, 92, 121, 112, 146, 97, 137, 105, 98, 117, 112, 81, 97, 139, 113, 134,
#      106, 144, 110, 137, 137, 111, 104, 117, 100, 111, 101, 110, 105, 129, 137, 112, 120, 113, 133, 112, 83, 94, 146,
#      133, 101, 131, 116, 111, 84, 137, 115, 122, 106, 144, 109, 123, 116, 111, 111, 133, 150]
# # 计算组数
# d = 3  # 组距
# num_bins = (max(a) - min(a)) // d
# # 设置图片大小
# plt.figure(figsize=(20, 8), dpi=80)
# plt.xticks(range(min(a), max(a) + d, d))
# # 绘制图片
# plt.hist(a, num_bins)  # density 频率
# # 数据展示
# plt.grid()
# plt.show()


# 散点图
y_3 = [11, 17, 16, 11, 12, 11, 12, 6, 6, 7, 8, 9, 12, 15, 14, 17, 18, 21, 16, 17, 20, 14, 15, 15, 15, 19, 21, 22, 22,
       22, 23]
y_10 = [26, 26, 28, 19, 21, 17, 16, 19, 18, 20, 20, 19, 22, 23, 17, 20, 21, 20, 22, 15, 11, 15, 5, 13, 17, 10, 11, 13,
        12, 13, 6]
x_3 = range(1, 32)
x_10 = range(51, 82)
# # 设置图片大小
# plt.figure(figsize=(20, 8), dpi=80)
# 设置可显示中文
plt.rcParams['font.sans-serif'] = ['SimHei']  # 显示中文标签
plt.rcParams['axes.unicode_minus'] = False
# 调整刻度
# x刻度
_x = list(x_3) + list(x_10)
_xticks_labels = ["3月{}日".format(i) for i in x_3]
_xticks_labels += ["10月{}日".format(i) for i in range(1, 32)]
plt.xticks(_x, _xticks_labels, rotation=60)
# y刻度
_y = list(y_3) + list(y_10)
_yticks_labels = ["{}度".format(i) for i in _y]
plt.yticks(_y, _yticks_labels)
# 绘制图片
plt.scatter(x_3, y_3, label='3月')
plt.scatter(x_10, y_10, label="10月")
# 添加图例
plt.legend()
# 添加描述信息
plt.xlabel("时间")
plt.ylabel("温度")
plt.title("3月和10月温度散点图")
# 绘制网格
plt.grid()
# 展示
plt.show()
